IDEA StatiCa Open Model
TypeEdgePosition Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type edge position
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum TypeEdgePosition
Public Enumeration TypeEdgePosition
public enum class TypeEdgePosition
Members
Member name | Value | Description
WholeLength | 0 |  whole length
PartEdge | 1 |  part of the edge, mereno od pocatku hrany nebo podle zadani v jinem properties
PartEdgeToEndEdge | 2 |  parts of the edge to end edge - pouze na vybranem vlasniku - napriklad u linioveho zatizeni na hrane
PartEdgeToSegment | 3 |  parts on edge, protazene az k segmentu nebo k poslenimu pruseciku s vnejsim obrysem - napriklad u vyztuze
PartEdgeFromEnd | 4 |  on part of edge measured from end of the edge
See Also
Reference
IdeaRS.OpenModel.Detail Namespace